---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded
source: html/d84c062e-4bfc-8da9-78f9-47174857db15.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded

Defines parameters for I-shape Welded structural section.

## Syntax (C#)
```csharp
public class StructuralSectionIWelded : StructuralSectionRectangular
```